

1. Создайте переменную с именем `x` и присвойте ей значение `3`.

**Решение:** 

`x = 3`

2. Создайте переменную с именем `y` и присвойте ей значение `2`.

**Решение:**

`y = 2`

3. Создайте переменную `z`, которая равна сумме `x` и `y`.

**Решение:**

`z = x + y`

4. Напишите программу, которая выводит строку `"Значение x равно 3, значение y равно 2, а значение z равно 5"`.

**Решение:**

```
print("Значение x равно {0}, значение y равно {1}, а значение z равно {2}".format(x, y, z))
```

5. Напишите программу, которая выводит произведение `x` и `y`, поделенное на `z`.

**Решение:**

```
print((x * y) / z)
```

6. Напишите программу, которая проверяет, равно ли значение `z` сумме `x` и `y`.

**Решение:**

```
if z == x + y:
    print("Значение z равно сумме x и y")
```

7. Напишите программу, которая создает строку `"Привет, мир!"`.

**Решение:**

`string = "Привет, мир!"`

8. Напишите программу, которая преобразует строку `"Привет, мир!"` в верхний регистр.

**Решение:**

`string = "Привет, мир!".upper()`

9. Напишите программу, которая преобразует строку `"Привет, мир!"` в нижний регистр.

**Решение:**

`string = "Привет, мир!".lower()`

10. Напишите программу, которая выводит число `5` с точностью до двух десятичных знаков.

**Решение:**

`print("{:.2f}".format(5))`

11. Напишите программу, которая принимает два целых числа `x` и `y` и выводит их сумму.

**Решение:**

```
x = int(input("Введите x: "))
y = int(input("Введите y: "))

print("Сумма x и y равна {0}".format(x + y))
```

12. Напишите программу, которая принимает три целых числа `x`, `y` и `z` и выводит их произведение.

**Решение:**

```
x = int(input("Введите x: "))
y = int(input("Введите y: "))
z = int(input("Введите z: "))

print("Произведение x, y и z равно {0}".format(x * y * z))
```

13. Напишите программу, которая выводит числа от `1` до `10` с помощью цикла `for`.

**Решение:**

```
for i in range(1, 11):
    print(i)
```

14. Напишите программу, которая выводит числа от `1` до `10` с помощью цикла `while`.

**Решение:**

```
i = 1

while i <= 10:
    print(i)
    i += 1
```

15. Напишите программу, которая выводит все четные числа от `2` до `20`.

**Решение:**

```
for i in range(2, 21, 2):
    print(i)
```

16. Напишите программу, которая принимает два целых числа `x` и `y` и выводит все числа от `x` до `y`.

**Решение:**

```
x = int(input("Введите x: "))
y = int(input("Введите y: "))

for i in range(x, y + 1):
    print(i)
```

17. Напишите программу, которая принимает два целых числа `x` и `y` и выводит все нечетные числа от `x` до `y`.

**Решение:**

```
x = int(input("Введите x: "))
y = int(input("Введите y: "))

for i in range(x, y + 1):
    if i % 2 != 0:
        print(i)
```

18. Напишите программу, которая принимает целое число `n` и выводит сумму всех чисел от `1` до `n`.

**Решение:**

```
n = int(input("Введите n: "))

sum = 0
for i in range(1, n + 1):
    sum += i

print("Сумма чисел от 1 до {0} равна {1}".format(n, sum))
```

19. Напишите программу, которая принимает целое число `n` и выводит произведение всех чисел от `1` до `n`.

**Решение:**

```
n = int(input("Введите n: "))

product = 1
for i in range(1, n + 1):
    product *= i

print("Произведение чисел от 1 до {0} равно {1}".format(n, product))
```

20. Напишите программу, которая принимает целое число `n` и выводит сумму всех четных чисел от `2` до `n`.

**Решение:**

```
n = int(input("Введите n: "))

sum = 0
for i in range(2, n + 1, 2):
    sum += i

print("Сумма четных чисел от 2 до {0} равна {1}".format(n, sum))
```