

1. Напишите программу, которая будет принимать два числа и выводить их сумму:

```python
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

# Вычисление суммы
sum = a + b

# Вывод результата
print("Сумма чисел:", sum)
```

2. Напишите программу, которая будет определять, является ли число четным или нечетным:

```python
num = int(input("Введите число: "))

# Проверка числа
if num % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")
```

3. Напишите программу, которая будет выводить числа от 1 до 10 используя цикл:

```python
# Использование цикла for
for i in range(1, 11):
    print(i)

# Использование цикла while
i = 1
while i <= 10:
    print(i)
    i += 1
```

4. Напишите программу, которая будет принимать строку и выводить ее в обратном порядке:

```python
# Ввод строки
s = input("Введите строку: ")

# Вывод строки в обратном порядке
print(s[::-1])
```

5. Напишите программу, которая будет считать количество слов в строке:

```python
# Ввод строки
s = input("Введите строку: ")

# Подсчет количества слов
words = s.split()
num_words = len(words)

# Вывод результата
print("Количество слов в строке:", num_words)
```

6. Напишите программу, которая будет принимать целое число и выводить его в двоичной системе счисления:

```python
# Ввод числа
num = int(input("Введите целое число: "))

# Преобразование в двоичную систему счисления
binary = bin(num)

# Вывод результата
print("Двоичное представление числа:", binary)
```

7. Напишите программу, которая будет принимать два списка и выводить новый список, состоящий из элементов, которые встречаются и в первом и во втором списке:

```python
# Ввод списков
list1 = input("Введите первый список: ").split()
list2 = input("Введите второй список: ").split()

# Создание нового списка
new_list = [i for i in list1 if i in list2]

# Вывод результата
print("Новый список:", new_list)
```

8. Напишите программу, которая будет принимать два списка и выводить новый список, состоящий из элементов, которые есть в первом списке, но нет во втором:

```python
# Ввод списков
list1 = input("Введите первый список: ").split()
list2 = input("Введите второй список: ").split()

# Создание нового списка
new_list = [i for i in list1 if i not in list2]

# Вывод результата
print("Новый список:", new_list)
```

9. Напишите программу, которая будет принимать слово и выводить его в обратном порядке:

```python
# Ввод слова
word = input("Введите слово: ")

# Вывод слова в обратном порядке
print(word[::-1])
```

10. Напишите программу, которая будет принимать целое число и выводить самую большую цифру в этом числе:

```python
# Ввод числа
num = int(input("Введите целое число: "))

# Поиск максимальной цифры
max_digit = 0
while num > 0:
    digit = num % 10
    if digit > max_digit:
        max_digit = digit
    num //= 10

# Вывод результата
print("Максимальная цифра:", max_digit)
```

11. Напишите программу, которая будет принимать целое число и выводить самую маленькую цифру в этом числе:

```python
# Ввод числа
num = int(input("Введите целое число: "))

# Поиск минимальной цифры
min_digit = 9
while num > 0:
    digit = num % 10
    if digit < min_digit:
        min_digit = digit
    num //= 10

# Вывод результата
print("Минимальная цифра:", min_digit)
```

12. Напишите программу, которая будет принимать строку и проверять, является ли она палиндромом:

```python
# Ввод строки
s = input("Введите строку: ")

# Проверка на палиндром
if s == s[::-1]:
    print("Строка является палиндромом")
else:
    print("Строка не является палиндромом")
```

13. Напишите программу, которая будет принимать строку и проверять, содержит ли она букву "a":

```python
# Ввод строки
s = input("Введите строку: ")

# Проверка на наличие буквы 'a'
if 'a' in s:
    print("В строке есть буква 'a'")
else:
    print("В строке нет буквы 'a'")
```

14. Напишите программу, которая будет принимать две строки и проверять, являются ли они анаграммами:

```python
# Ввод строк
s1 = input("Введите первую строку: ")
s2 = input("Введите вторую строку: ")

# Проверка на анаграммы
s1_list = sorted(list(s1))
s2_list = sorted(list(s2))

if s1_list == s2_list:
    print("Строки являются анаграммами")
else:
    print("Строки не являются анаграммами")
```

15. На